app/controllers/lists_controller.rb

SELECT  "lists".* FROM "lists"  ORDER BY "lists"."id" ASC LIMIT 1
---
  def index
    @lists = List.all

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Personal"], ["created_at", "2015-02-10 17:44:14.827779"], ["updated_at", "2015-02-10 17:44:14.827779"]]
SELECT "lists".* FROM "lists"
---
  def create
    @list = List.create
    @list.name = params[:name]
    @list.save
    @lists = List.all

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 295]]
SELECT "lists".* FROM "lists"
---
  def destroy
    List.destroy(params[:id].to_i)
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 297]]
---
  def edit
    @list = List.find_by(id: params[:id].to_i )