app/controllers/tasks_controller.rb

  def index
    @list_id = params[:list_id].to_i
    @list = List.find_by(id: @list_id )
    @tasks = Task.get_tasks_by_list_id( @list_id )
    @task = Task.order("id").first == nil ? nil : Task.order("id").first
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "tasks".* FROM "tasks"  ORDER BY id LIMIT 1

  def create
    # logger.debug "attempting to create a task with list id: #{params[:task][:list_id]}. params is: #{params}"
    task_params = params[:task]
    @task = Task.create
    @task.list_id = task_params[:list_id]
    @task.description = task_params[:description]
    @task.due_date = task_params[:due_date]
    @task.done = false
    @task.save
    @tasks = Task.get_tasks_by_list_id( @task.list_id )
    @list = List.find_by(id: @task.list_id )
---
INSERT INTO "tasks" ("list_id", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["list_id", 292], ["description", "wash the car"], ["due_date", "2015-02-11"], ["created_at", "2015-02-10 22:17:47.402186"], ["updated_at", "2015-02-10 22:17:47.402186"]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 292]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 292]]

  def update
    logger.debug "attempting to update a task with id: #{params[:id]}. params is: #{params}"
    @task = Task.find_by(id: params[:id].to_i)
    @task.done = params[:task][:done] == "1" ? true : false
    @task.save
    @tasks = Task.get_tasks_by_list_id( @task.list_id )
    @list = List.find_by(id: @task.list_id )
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 114]]
UPDATE "tasks" SET "done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["done", "t"], ["updated_at", "2015-02-11 00:00:55.177750"], ["id", 114]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 292]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 292]]

  def destroy
    logger.debug "attempting to delete a task with id: #{params[:id]}. params is: #{params}"
    @task = Task.find_by(id: params[:id].to_i)
    @list_id = @task.list_id
    @list = List.find_by(id: @list_id )
    Task.destroy(params[:id].to_i)
    @tasks = Task.get_tasks_by_list_id( @list_id )
    @task = Task.order("id").first == nil ? nil : Task.order("id").first
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 112]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 292]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 112]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 292]]